#+title: Contrast ratio values of the Doric themes
#+author: Protesilaos Stavrou (https://protesilaos.com)
#+startup: content indent

Evaluate this snippet. Then update a table by typing =C-c C-c= with
point at the =#+TBLFM:= line.

#+begin_src emacs-lisp :results output silent
;; Copied from my `modus-themes'.

;; This is the WCAG formula to measure relative luminance:
;; <https://www.w3.org/TR/WCAG20-TECHS/G18.html>.
(defun modus-themes--wcag-contribution (channel weight)
  "Return the CHANNEL contribution to overall luminance given WEIGHT."
  (* weight
     (if (<= channel 0.03928)
         (/ channel 12.92)
       (expt (/ (+ channel 0.055) 1.055) 2.4))))

(defun modus-themes-wcag-formula (hex)
  "Get WCAG value of color value HEX.
The value is defined in hexadecimal RGB notation, such #123456."
  (let ((channels (color-name-to-rgb hex))
        (weights '(0.2126 0.7152 0.0722))
        contribution)
    (while channels
      (push (modus-themes--wcag-contribution (pop channels) (pop weights)) contribution))
    (apply #'+ contribution)))

;;;###autoload
(defun modus-themes-contrast (c1 c2)
  "Measure WCAG contrast ratio between C1 and C2.
C1 and C2 are color values written in hexadecimal RGB."
  (let ((ct (/ (+ (modus-themes-wcag-formula c1) 0.05)
               (+ (modus-themes-wcag-formula c2) 0.05))))
    (max ct (/ ct))))

(defalias #'Λ #'modus-themes-contrast)

;; Just an alias for the built-in function that measures distance
;; between colours...
(defalias #'Δ #'color-distance)
#+end_src

* Light themes
:PROPERTIES:
:CUSTOM_ID: h:light-themes
:END:
** Doric Beach
:PROPERTIES:
:CUSTOM_ID: h:doric-beach
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #eae3d8 |          #ded4c0 |    #d4c2ab |           #abd2c9 |   #efd0a9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #213937 |    9.66 |             8.38 |       7.10 |              7.50 |      8.37 |
| fg-shadow-subtle  | #605d48 |    5.22 |             4.53 |       3.83 |              4.05 |      4.52 |
| fg-neutral        | #504533 |    7.36 |             6.38 |       5.40 |              5.71 |      6.37 |
| fg-shadow-intense | #045e53 |    6.03 |             5.23 |       4.43 |              4.68 |      5.22 |
| fg-accent         | #834328 |    5.89 |             5.10 |       4.33 |              4.57 |      5.10 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #902000 |    6.89 |             5.97 |       5.06 |              5.35 |      5.96 |
| fg-green          | #006000 |    6.16 |             5.34 |       4.53 |              4.79 |      5.34 |
| fg-yellow         | #595000 |    6.41 |             5.55 |       4.71 |              4.97 |      5.55 |
| fg-blue           | #103077 |    9.63 |             8.35 |       7.07 |              7.48 |      8.34 |
| fg-magenta        | #700054 |    9.07 |             7.86 |       6.66 |              7.04 |      7.85 |
| fg-cyan           | #005460 |    6.76 |             5.86 |       4.97 |              5.25 |      5.85 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #eae3d8 |          #ded4c0 |    #d4c2ab |           #abd2c9 |   #efd0a9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #eae3d8 |       0 |             2549 |      10130 |             12841 |      6143 |
| bg-shadow-subtle  | #ded4c0 |    2549 |                0 |       2548 |              7460 |      2027 |
| bg-neutral        | #d4c2ab |   10130 |             2548 |          0 |              7732 |      2917 |
| bg-shadow-intense | #abd2c9 |   12841 |             7460 |       7732 |                 0 |     15349 |
| bg-accent         | #efd0a9 |    6143 |             2027 |       2917 |             15349 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Cherry
:PROPERTIES:
:CUSTOM_ID: h:doric-cherry
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #d7c9d0 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #35292f |   12.15 |            10.43 |       8.71 |              5.66 |      9.39 |
| fg-shadow-subtle  | #675462 |    6.07 |             5.21 |       4.35 |              2.83 |      4.69 |
| fg-neutral        | #4e4053 |    8.40 |             7.22 |       6.03 |              3.92 |      6.50 |
| fg-shadow-intense | #683455 |    8.29 |             7.12 |       5.95 |              3.87 |      6.41 |
| fg-accent         | #77266e |    8.02 |             6.89 |       5.75 |              3.74 |      6.20 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a00040 |    7.14 |             6.13 |       5.12 |              3.33 |      5.52 |
| fg-green          | #006730 |    6.15 |             5.28 |       4.41 |              2.87 |      4.75 |
| fg-yellow         | #704000 |    7.57 |             6.50 |       5.43 |              3.53 |      5.85 |
| fg-blue           | #203080 |   10.21 |             8.77 |       7.32 |              4.76 |      7.90 |
| fg-magenta        | #800060 |    8.79 |             7.55 |       6.30 |              4.10 |      6.80 |
| fg-cyan           | #005560 |    7.43 |             6.38 |       5.33 |              3.46 |      5.75 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #d7c9d0 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f7edf1 |       0 |             2591 |       6292 |             43766 |      5533 |
| bg-shadow-subtle  | #e5dde0 |    2591 |                0 |        890 |             26336 |      1695 |
| bg-neutral        | #d7c9d0 |   10521 |             2728 |        556 |             12616 |      2351 |
| bg-shadow-intense | #cc95b7 |   43766 |            26336 |      17584 |                 0 |     19021 |
| bg-accent         | #edcae5 |    5533 |             1695 |       1022 |             19021 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Earth
:PROPERTIES:
:CUSTOM_ID: h:doric-earth
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d1ceb6 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #30232e |   12.72 |            11.09 |       9.40 |              6.20 |     10.40 |
| fg-shadow-subtle  | #635650 |    6.01 |             5.23 |       4.44 |              2.92 |      4.91 |
| fg-neutral        | #504033 |    8.43 |             7.34 |       6.23 |              4.10 |      6.89 |
| fg-shadow-intense | #58383f |    8.71 |             7.59 |       6.44 |              4.24 |      7.12 |
| fg-accent         | #74321f |    8.06 |             7.02 |       5.96 |              3.93 |      6.59 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a03000 |    6.13 |             5.34 |       4.53 |              2.98 |      5.01 |
| fg-green          | #206700 |    5.96 |             5.19 |       4.40 |              2.90 |      4.87 |
| fg-yellow         | #705200 |    6.18 |             5.38 |       4.56 |              3.01 |      5.05 |
| fg-blue           | #103060 |   11.08 |             9.66 |       8.19 |              5.40 |      9.06 |
| fg-magenta        | #690f44 |   10.21 |             8.89 |       7.54 |              4.97 |      8.34 |
| fg-cyan           | #105f66 |    6.27 |             5.47 |       4.64 |              3.05 |      5.13 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d1ceb6 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #f0eddf |       0 |             2246 |      10254 |             39749 |      5582 |
| bg-shadow-subtle  | #dfdfce |    2246 |                0 |       2977 |             23899 |      1527 |
| bg-neutral        | #d1ceb6 |   10254 |             2977 |          0 |             10796 |      1613 |
| bg-shadow-intense | #c09fa0 |   39749 |            23899 |      10796 |                 0 |     17459 |
| bg-accent         | #e7d5b9 |    5582 |             1527 |       1613 |             17459 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Light
:PROPERTIES:
:CUSTOM_ID: h:doric-light
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #dbdce1 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      15.34 |             10.60 |     17.80 |
| fg-shadow-subtle  | #5a6268 |    6.21 |             5.41 |       4.54 |              3.13 |      5.26 |
| fg-neutral        | #424d53 |    8.68 |             7.57 |       6.34 |              4.38 |      7.36 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.11 |              6.30 |     10.57 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.10 |              4.91 |      8.24 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a01010 |    8.15 |             7.10 |       5.95 |              4.11 |      6.91 |
| fg-green          | #106710 |    7.07 |             6.16 |       5.16 |              3.57 |      5.99 |
| fg-yellow         | #60400f |    9.38 |             8.18 |       6.85 |              4.74 |      7.95 |
| fg-blue           | #103077 |   12.27 |            10.69 |       8.96 |              6.19 |     10.40 |
| fg-magenta        | #700d50 |   11.28 |             9.83 |       8.24 |              5.69 |      9.56 |
| fg-cyan           | #005355 |    8.87 |             7.73 |       6.48 |              4.47 |      7.51 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #dbdce1 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ffffff |       0 |             2143 |       7009 |             48556 |      5572 |
| bg-shadow-subtle  | #efeff2 |    2143 |                0 |       1418 |             30569 |      1560 |
| bg-neutral        | #dbdce1 |   10642 |             3235 |        396 |             14408 |      2504 |
| bg-shadow-intense | #a0bcd0 |   48556 |            30569 |      19178 |                 0 |     22768 |
| bg-accent         | #d8f1f3 |    5572 |             1560 |       1336 |             22768 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Marble
:PROPERTIES:
:CUSTOM_ID: h:doric-marble
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #cdcdcd |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #202020 |   13.92 |            12.23 |      10.25 |              7.51 |     11.53 |
| fg-shadow-subtle  | #595959 |    5.98 |             5.26 |       4.41 |              3.23 |      4.96 |
| fg-neutral        | #4a4a4a |    7.57 |             6.65 |       5.57 |              4.09 |      6.27 |
| fg-shadow-intense | #404040 |    8.86 |             7.78 |       6.52 |              4.78 |      7.34 |
| fg-accent         | #603d3a |    8.06 |             7.08 |       5.93 |              4.35 |      6.67 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a01010 |    6.96 |             6.12 |       5.13 |              3.76 |      5.77 |
| fg-green          | #106710 |    6.04 |             5.31 |       4.45 |              3.26 |      5.00 |
| fg-yellow         | #60400f |    8.02 |             7.04 |       5.90 |              4.33 |      6.64 |
| fg-blue           | #103077 |   10.48 |             9.21 |       7.72 |              5.66 |      8.68 |
| fg-magenta        | #700d50 |    9.63 |             8.46 |       7.09 |              5.20 |      7.98 |
| fg-cyan           | #005355 |    7.57 |             6.65 |       5.58 |              4.09 |      6.27 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #cdcdcd |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #ededed |       0 |             1777 |       9288 |             33751 |      5503 |
| bg-shadow-subtle  | #dfdfdf |    1777 |                0 |       2938 |             20036 |      1802 |
| bg-neutral        | #cdcdcd |    9288 |             2938 |          0 |              7628 |      2196 |
| bg-shadow-intense | #b0b0b0 |   33751 |            20036 |       7628 |                 0 |     15022 |
| bg-accent         | #e5d7c5 |    5503 |             1802 |       2196 |             15022 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Oak
:PROPERTIES:
:CUSTOM_ID: h:doric-oak
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e0d8c7 |          #d5c9b5 |    #c2b19e |           #b1bf88 |   #b7d2b7 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #3a2018 |   10.59 |             9.18 |       7.20 |              7.63 |      9.23 |
| fg-shadow-subtle  | #6b5225 |    5.18 |             4.50 |       3.52 |              3.73 |      4.52 |
| fg-neutral        | #53402f |    6.92 |             6.00 |       4.70 |              4.98 |      6.03 |
| fg-shadow-intense | #3f5000 |    6.28 |             5.45 |       4.27 |              4.53 |      5.48 |
| fg-accent         | #0f5720 |    6.16 |             5.34 |       4.19 |              4.44 |      5.37 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #982500 |    5.70 |             4.94 |       3.88 |              4.11 |      4.97 |
| fg-green          | #226700 |    4.93 |             4.27 |       3.35 |              3.55 |      4.29 |
| fg-yellow         | #595000 |    5.76 |             5.00 |       3.92 |              4.15 |      5.02 |
| fg-blue           | #103077 |    8.66 |             7.51 |       5.89 |              6.24 |      7.55 |
| fg-magenta        | #700054 |    8.15 |             7.07 |       5.55 |              5.88 |      7.11 |
| fg-cyan           | #005460 |    6.08 |             5.27 |       4.13 |              4.38 |      5.30 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e0d8c7 |          #d5c9b5 |    #c2b19e |           #a5b47f |   #b7d2b7 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #e0d8c7 |       0 |             1955 |      12383 |             26605 |      5453 |
| bg-shadow-subtle  | #d5c9b5 |    1955 |                0 |       4513 |             14781 |      2853 |
| bg-neutral        | #c2b19e |   12383 |             4513 |          0 |              4551 |      6148 |
| bg-shadow-intense | #a5b47f |   26605 |            14781 |       4551 |                 0 |     11829 |
| bg-accent         | #b7d2b7 |    5453 |             2853 |       6148 |             11829 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Wind
:PROPERTIES:
:CUSTOM_ID: h:doric-wind
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d5e1d9 |    #c2ced0 |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000f0f |   16.81 |            14.51 |      12.12 |              9.98 |     13.82 |
| fg-shadow-subtle  | #565962 |    6.02 |             5.20 |       4.34 |              3.57 |      4.95 |
| fg-neutral        | #404248 |    8.64 |             7.46 |       6.23 |              5.13 |      7.10 |
| fg-shadow-intense | #104038 |    9.97 |             8.61 |       7.19 |              5.92 |      8.20 |
| fg-accent         | #2f6920 |    5.71 |             4.93 |       4.12 |              3.39 |      4.70 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #990020 |    7.61 |             6.57 |       5.49 |              4.52 |      6.25 |
| fg-green          | #006710 |    6.13 |             5.29 |       4.42 |              3.64 |      5.04 |
| fg-yellow         | #706000 |    5.38 |             4.64 |       3.88 |              3.19 |      4.42 |
| fg-blue           | #003370 |   10.58 |             9.14 |       7.63 |              6.28 |      8.70 |
| fg-magenta        | #782050 |    8.52 |             7.36 |       6.14 |              5.06 |      7.00 |
| fg-cyan           | #006070 |    6.22 |             5.37 |       4.48 |              3.69 |      5.11 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d5e1d9 |    #c2ced0 |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #e8f0e9 |       0 |             2501 |      10149 |             32059 |      8580 |
| bg-shadow-subtle  | #d5e1d9 |    2501 |                0 |       2653 |             16965 |      2531 |
| bg-neutral        | #c2ced0 |   10149 |             2653 |          0 |              6954 |      2528 |
| bg-shadow-intense | #94c2bf |   32059 |            16965 |       6954 |                 0 |     11285 |
| bg-accent         | #c7e2c1 |    7387 |             1831 |       2187 |             11163 |       136 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

* Dark themes
:PROPERTIES:
:CUSTOM_ID: h:dark-themes
:END:
** Doric Dark
:PROPERTIES:
:CUSTOM_ID: h:doric-dark
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #43404c |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #ffffff |   21.00 |            13.35 |      10.11 |              8.49 |     12.97 |
| fg-shadow-subtle  | #a2a0b2 |    8.21 |             5.22 |       3.95 |              3.32 |      5.07 |
| fg-neutral        | #c5c7d4 |   12.49 |             7.94 |       6.02 |              5.05 |      7.72 |
| fg-shadow-intense | #cfcff8 |   13.93 |             8.86 |       6.71 |              5.63 |      8.61 |
| fg-accent         | #cda4df |    9.97 |             6.34 |       4.80 |              4.03 |      6.16 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |   10.13 |             6.44 |       4.88 |              4.09 |      6.26 |
| fg-green          | #b9d0aa |   12.67 |             8.05 |       6.10 |              5.12 |      7.83 |
| fg-yellow         | #c0b080 |    9.76 |             6.21 |       4.70 |              3.95 |      6.03 |
| fg-blue           | #9fbfe7 |   11.08 |             7.04 |       5.34 |              4.48 |      6.85 |
| fg-magenta        | #e9acbf |   11.12 |             7.07 |       5.35 |              4.49 |      6.87 |
| fg-cyan           | #a0c0d0 |   10.95 |             6.96 |       5.27 |              4.42 |      6.76 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #43404c |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #000000 |       0 |            22833 |      42853 |             78768 |     29991 |
| bg-shadow-subtle  | #332d38 |   22833 |                0 |       3147 |             17981 |      3273 |
| bg-neutral        | #43404c |   42853 |             3147 |          0 |              7562 |      5572 |
| bg-shadow-intense | #50447f |   78768 |            17981 |       7562 |                 0 |     16560 |
| bg-accent         | #521e40 |   29991 |             3273 |       5572 |             16560 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Fire
:PROPERTIES:
:CUSTOM_ID: h:doric-fire
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #282420 |          #40332f |    #4f4542 |           #7c362c |   #56452f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #f5ceb0 |   10.52 |             8.28 |       6.34 |              5.92 |      6.27 |
| fg-shadow-subtle  | #afa497 |    6.29 |             4.95 |       3.79 |              3.54 |      3.75 |
| fg-neutral        | #d9cfbe |    9.99 |             7.86 |       6.02 |              5.63 |      5.95 |
| fg-shadow-intense | #f3ac6f |    8.02 |             6.32 |       4.84 |              4.52 |      4.78 |
| fg-accent         | #d6b577 |    7.87 |             6.20 |       4.75 |              4.43 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca27f |    7.43 |             5.85 |       4.48 |              4.18 |      4.43 |
| fg-green          | #b9d08a |    9.29 |             7.31 |       5.60 |              5.23 |      5.54 |
| fg-yellow         | #c0b080 |    7.16 |             5.64 |       4.32 |              4.03 |      4.27 |
| fg-blue           | #9fbfe7 |    8.13 |             6.40 |       4.90 |              4.58 |      4.84 |
| fg-magenta        | #e9acbf |    8.15 |             6.42 |       4.91 |              4.59 |      4.86 |
| fg-cyan           | #a0c0d0 |    8.03 |             6.32 |       4.84 |              4.52 |      4.78 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #282420 |          #40332f |    #4f4542 |           #7c362c |   #56452f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #282420 |       0 |             2820 |      11036 |             18204 |      9806 |
| bg-shadow-subtle  | #40332f |    2820 |                0 |       2812 |              8653 |      2425 |
| bg-neutral        | #4f4542 |   11036 |             2812 |          0 |              7070 |      1088 |
| bg-shadow-intense | #7c362c |   18204 |             8653 |       7070 |                 0 |      4440 |
| bg-accent         | #56452f |    9806 |             2425 |       1088 |              4440 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Obsidian
:PROPERTIES:
:CUSTOM_ID: h:doric-obsidian
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7e7e7 |   14.36 |            10.83 |       9.20 |              6.52 |     10.12 |
| fg-shadow-subtle  | #969696 |    6.00 |             4.53 |       3.85 |              2.73 |      4.23 |
| fg-neutral        | #bcbcbc |    9.35 |             7.05 |       5.99 |              4.25 |      6.59 |
| fg-shadow-intense | #b0b0b0 |    8.19 |             6.17 |       5.24 |              3.72 |      5.77 |
| fg-accent         | #b59487 |    6.38 |             4.81 |       4.09 |              2.90 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    8.57 |             6.46 |       5.49 |              3.89 |      6.04 |
| fg-green          | #b9d0aa |   10.71 |             8.07 |       6.86 |              4.86 |      7.54 |
| fg-yellow         | #c0b080 |    8.26 |             6.22 |       5.29 |              3.75 |      5.82 |
| fg-blue           | #9fbfe7 |    9.37 |             7.06 |       6.00 |              4.25 |      6.60 |
| fg-magenta        | #e9acbf |    9.40 |             7.09 |       6.02 |              4.27 |      6.62 |
| fg-cyan           | #a0c0d0 |    9.25 |             6.98 |       5.93 |              4.20 |      6.52 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #181818 |       0 |             4798 |      10485 |             28444 |      7113 |
| bg-shadow-subtle  | #2f2f2f |    4798 |                0 |       1097 |              9877 |       966 |
| bg-neutral        | #3a3a3a |   10485 |             1097 |          0 |              4390 |      1381 |
| bg-shadow-intense | #505050 |   28444 |             9877 |       4390 |                 0 |      8726 |
| bg-accent         | #432f2a |    7113 |              966 |       1381 |              8726 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Pine
:PROPERTIES:
:CUSTOM_ID: h:doric-pine
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #303f2d |          #40503d |    #575f4b |           #70523a |   #305d42 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #d0e2c8 |    8.21 |             6.33 |       4.90 |              5.21 |      5.56 |
| fg-shadow-subtle  | #bcbeaf |    5.93 |             4.57 |       3.54 |              3.76 |      4.02 |
| fg-neutral        | #cdd9be |    7.61 |             5.86 |       4.54 |              4.82 |      5.15 |
| fg-shadow-intense | #c8b399 |    5.53 |             4.26 |       3.30 |              3.50 |      3.74 |
| fg-accent         | #b0d593 |    6.82 |             5.26 |       4.07 |              4.32 |      4.62 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #e8a28f |    5.33 |             4.11 |       3.18 |              3.38 |      3.61 |
| fg-green          | #a2d09a |    6.41 |             4.94 |       3.83 |              4.07 |      4.34 |
| fg-yellow         | #c4b980 |    5.65 |             4.36 |       3.37 |              3.58 |      3.83 |
| fg-blue           | #98bae0 |    5.57 |             4.29 |       3.32 |              3.53 |      3.77 |
| fg-magenta        | #e9acbf |    5.93 |             4.57 |       3.54 |              3.76 |      4.01 |
| fg-cyan           | #a0c0d0 |    5.84 |             4.50 |       3.48 |              3.70 |      3.95 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #303f2d |          #40503d |    #575f4b |           #70523a |   #305d42 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #303f2d |       0 |             2455 |      10080 |             11464 |      4877 |
| bg-shadow-subtle  | #40503d |    2455 |                0 |       2665 |              5485 |      1324 |
| bg-neutral        | #575f4b |   10080 |             2665 |          0 |              2946 |      3710 |
| bg-shadow-intense | #70523a |   11464 |             5485 |       2946 |                 0 |     10212 |
| bg-accent         | #305d42 |    4877 |             1324 |       3710 |             10212 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Plum
:PROPERTIES:
:CUSTOM_ID: h:doric-plum
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e2d7e7 |   12.14 |             9.46 |       7.62 |              6.13 |      9.46 |
| fg-shadow-subtle  | #a694b1 |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
| fg-neutral        | #c6c1d3 |    9.62 |             7.49 |       6.04 |              4.85 |      7.50 |
| fg-shadow-intense | #cea6d0 |    8.03 |             6.25 |       5.04 |              4.05 |      6.26 |
| fg-accent         | #c586ba |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    8.14 |             6.34 |       5.11 |              4.11 |      6.35 |
| fg-green          | #b9d0aa |   10.18 |             7.93 |       6.39 |              5.14 |      7.93 |
| fg-yellow         | #c0b080 |    7.84 |             6.11 |       4.93 |              3.96 |      6.12 |
| fg-blue           | #9fbfe7 |    8.90 |             6.94 |       5.59 |              4.49 |      6.94 |
| fg-magenta        | #e9acbf |    8.93 |             6.96 |       5.61 |              4.51 |      6.96 |
| fg-cyan           | #a0c0d0 |    8.79 |             6.85 |       5.52 |              4.44 |      6.86 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #221832 |       0 |             2845 |      10282 |             25593 |      5289 |
| bg-shadow-subtle  | #302f3c |    2845 |                0 |       2786 |             13581 |      3499 |
| bg-neutral        | #423b53 |   10282 |             2786 |          0 |              4250 |      5048 |
| bg-shadow-intense | #5e4170 |   25593 |            13581 |       4250 |                 0 |     12099 |
| bg-accent         | #501e3e |    5289 |             3499 |       5048 |             12099 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Valley
:PROPERTIES:
:CUSTOM_ID: h:doric-valley
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #383035 |          #484040 |    #554f52 |           #3d5e57 |   #714d4c |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e0d5b7 |    8.75 |             6.90 |       5.47 |              4.89 |      5.01 |
| fg-shadow-subtle  | #afa497 |    5.22 |             4.12 |       3.27 |              2.92 |      2.99 |
| fg-neutral        | #d9cfbe |    8.29 |             6.54 |       5.19 |              4.64 |      4.75 |
| fg-shadow-intense | #99dec7 |    8.30 |             6.54 |       5.19 |              4.64 |      4.75 |
| fg-accent         | #f6c097 |    7.86 |             6.20 |       4.91 |              4.39 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #f6c097 |    7.86 |             6.20 |       4.91 |              4.39 |      4.50 |
| fg-green          | #b9d0aa |    7.71 |             6.08 |       4.82 |              4.31 |      4.42 |
| fg-yellow         | #c0b060 |    5.86 |             4.62 |       3.66 |              3.28 |      3.35 |
| fg-blue           | #9fbfe7 |    6.75 |             5.32 |       4.22 |              3.77 |      3.86 |
| fg-magenta        | #e9acbf |    6.77 |             5.34 |       4.23 |              3.79 |      3.88 |
| fg-cyan           | #a0c0d0 |    6.66 |             5.25 |       4.17 |              3.73 |      3.82 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #383035 |          #484040 |    #554f52 |           #3d5e57 |   #74564e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #383035 |       0 |             1948 |       8111 |             11814 |     15978 |
| bg-shadow-subtle  | #484040 |    1948 |                0 |       2179 |              5364 |      7092 |
| bg-neutral        | #554f52 |    8111 |             2179 |          0 |              2302 |      2558 |
| bg-shadow-intense | #3d5e57 |   11814 |             5364 |       2302 |                 0 |      7629 |
| bg-accent         | #74564e |   15978 |             7092 |       2558 |              7629 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)

** Doric Water
:PROPERTIES:
:CUSTOM_ID: h:doric-water
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #3a3c4c |    #4a4a5f |           #496278 |   #403f75 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #edf0f8 |   12.54 |             9.54 |       7.56 |              5.58 |      8.43 |
| fg-shadow-subtle  | #aea6b8 |    6.09 |             4.63 |       3.67 |              2.71 |      4.09 |
| fg-neutral        | #d4d9dc |   10.04 |             7.64 |       6.06 |              4.47 |      6.75 |
| fg-shadow-intense | #c0ddf2 |   10.12 |             7.70 |       6.10 |              4.50 |      6.80 |
| fg-accent         | #adade0 |    6.69 |             5.09 |       4.04 |              2.98 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    6.90 |             5.25 |       4.16 |              3.07 |      4.63 |
| fg-green          | #a0d0ba |    8.32 |             6.33 |       5.02 |              3.70 |      5.59 |
| fg-yellow         | #c0b080 |    6.64 |             5.06 |       4.01 |              2.96 |      4.47 |
| fg-blue           | #9fbfe7 |    7.54 |             5.74 |       4.55 |              3.36 |      5.07 |
| fg-magenta        | #e9acbf |    7.57 |             5.76 |       4.56 |              3.37 |      5.09 |
| fg-cyan           | #a0c0d0 |    7.45 |             5.67 |       4.49 |              3.32 |      5.01 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #3a3c4c |    #4a4a5f |           #496278 |   #403f75 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| bg-main           | #2a283d |       0 |             2814 |      10189 |             25450 |     12034 |
| bg-shadow-subtle  | #3a3c4c |    2814 |                0 |       2370 |             11685 |      4794 |
| bg-neutral        | #4a4a5f |   10189 |             2370 |          0 |              4032 |      2047 |
| bg-shadow-intense | #496278 |   25450 |            11685 |       4032 |                 0 |      5148 |
| bg-accent         | #403f75 |   12034 |             4794 |       2047 |              5148 |         0 |
#+TBLFM: $3='(Δ $2 @2$3) :: $4='(Δ $2 @2$4) :: $5='(Δ $2 @2$5) :: $6='(Δ $2 @2$6) :: $7='(Δ $2 @2$7)
